<?php

use Illuminate\Database\Seeder;

class StocksTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $stocks = [
            [
                'title' => 'Доплата 40 000 рублей при обмене на LADA Granta',
                'text' => '
                <p>Воспользуйтесь возможностью обменять свой автомобиль с дополнительной выгодой - 40 000 рублей.</p>
                <p>Обменять свой автомобиль в Брайт Парке - это удобно. Вам не нужно задумываться о реализации автомобиля, эту задачу на себя возьмут специалисты дилерского центра. Кроме того, участники программы обмена получают преимущество в виде выгоды на покупку нового автомобиля.</p>
                <p>Также у вас есть уникальная возможность оценки вашего автомобиля онлайн по фото и видео вашего автомобиля.</p>
                <p>Перечень документов покупателя:</p>
                <ul>
                    <li>Паспорт гражданина РФ, владельца автомобиля.</li>
                    <li>Оригинал ПТС, подтверждающий срок владения автомобилем (не менее 6 месяцев).</li>
                    <li>Оригинал «Свидетельства о регистрации транспортного средства».</li>
                    <li>Копия паспорта транспортного средства БУ автомобиля с записью о переходе права собственности покупателю.</li>
                    <li>Документ выдан органами ГИБДД о регистрации БУ автомобиля за данным потребителем (КУТС либо справка, либо копия ПТС заверенная оригинальной печатью уполномоченного органа ГИБДД, либо копия ПТС заверенная нотариально).</li>
                </ul>
                ',
                'text_short' => 'Воспользуйтесь возможностью обменять свой автомобиль с дополнительной выгодой - 40 000 рублей.',
                'preview' => '/build/images/stocks/stock_01.jpg',
                'slug' => 'doplata_40_000_rublej_pri_obmene_na_lada_granta',
                'city_id' => 0,
            ],
            [
                'title' => 'LADA Vesta выгода 10% по госпрограмме',
                'text' => '
                <p>Воспользуйтесь возможностью приобрести автомобиль LADA с выгодой 10% от стоимости по государственным программам «Первый автомобиль» и «Семейный автомобиль».</p>
                <p>Льготный автокредит может быть выдан без первоначального взноса.</br>
                  Программами «Первый автомобиль» и «Семейный автомобиль» можно воспользоваться при условиях:</p>
                <ul>
                    <li>наличие действующих водительских прав;</li>
                    <li>отсутствие других автокредитов в течение 2018, 2019 года;</li>
                    <li>покупатель никогда ранее не имел автомобиль в собственности (условие для программы "Первый автомобиль"); </li>
                    <li>у Вас двое и больше несовершеннолетних детей. В банк необходимо предоставить паспорт, куда вписаны дети или их свидетельства о рождении (условие для программы "Семейный автомобиль").</li>
                </ul>
                <table>
                    <thead></thead>
                        <tr>
                            <th></th>
                            <th>Выгода по программе ПЕРВЫЙ / СЕМЕЙНЫЙ АВТОМОБИЛЬ</th>
                        </tr>
                    </thead>
                    <tbody>
                        <tr>
                            <td class="tbl_title">Granta Седан</td>
                            <td class="tbl_value">До 96 080 руб.</td>
                        </tr>
                        <tr>
                            <td class="tbl_title">Granta Лифтбек</td>
                            <td class="tbl_value">До 97 580 руб.</td>
                        </tr>
                        <tr>
                            <td class="tbl_title">Granta Хэтчбек</td>
                            <td class="tbl_value">До 97 580 руб.</td>
                        </tr>
                        <tr>
                            <td class="tbl_title">Granta Универсал</td>
                            <td class="tbl_value">До 98 580 руб.</td>
                        </tr>
                        <tr>
                            <td class="tbl_title">Granta Cross</td>
                            <td class="tbl_value">До 84 390 руб.</td>
                        </tr>
                        <tr>
                            <td class="tbl_title">Granta Drive Active</td>
                            <td class="tbl_value">До 60 000 руб.</td>
                        </tr>
                        <tr>
                            <td class="tbl_title">Vesta Cедан</td>
                            <td class="tbl_value">До 148 140 руб.</td>
                        </tr>
                        <tr>
                            <td class="tbl_title">Vesta Cross</td>
                            <td class="tbl_value">До 155 090 руб.</td>
                        </tr>
                        <tr>
                            <td class="tbl_title">Vesta SW</td>
                            <td class="tbl_value">До 153 390 руб.</td>
                        </tr>
                        <tr>
                            <td class="tbl_title">Vesta SW Cross</td>
                            <td class="tbl_value">До 159 090 руб.</td>
                        </tr>
                        <tr>
                            <td class="tbl_title">Vesta CNG</td>
                            <td class="tbl_value">До 131 590 руб.</td>
                        </tr>
                        <tr>
                            <td class="tbl_title">Vesta Sport </td>
                            <td class="tbl_value">До 179 890 руб.</td>
                        </tr>
                        <tr>
                            <td class="tbl_title">XRAY</td>
                            <td class="tbl_value">До 162 090 руб.</td>
                        </tr>
                        <tr>
                            <td class="tbl_title">XRAY Cross </td>
                            <td class="tbl_value">До 146 990 руб.</td>
                        </tr>
                        <tr>
                            <td class="tbl_title">Largus Универсал</td>
                            <td class="tbl_value">До 135 490 руб.</td>
                        </tr>
                        <tr>
                            <td class="tbl_title">Largus Cross</td>
                            <td class="tbl_value">До 138 390 руб.</td>
                        </tr>
                        <tr>
                            <td class="tbl_title">Largus Фургон</td>
                            <td class="tbl_value">До 124 090 руб.</td>
                        </tr>
                        <tr>
                            <td class="tbl_title">4x4 3 дв.</td>
                            <td class="tbl_value">До 79 590 руб.</td>
                        </tr>
                        <tr>
                            <td class="tbl_title">4x4 Urban 3 дв.</td>
                            <td class="tbl_value">До 78 190 руб.</td>
                        </tr>
                        <tr>
                            <td class="tbl_title">4x4 5дв.</td>
                            <td class="tbl_value">До 81 390 руб.</td>
                        </tr>
                        <tr>
                            <td class="tbl_title">4x4 Urban 5 дв.</td>
                            <td class="tbl_value">До 82 090 руб.</td>
                        </tr>
                        <tr>
                            <td class="tbl_title">4x4 Bronto</td>
                            <td class="tbl_value">До 20 000 руб.</td>
                        </tr>
                    </tbody>
                </table>
                ',
                'text_short' => 'Воспользуйтесь возможностью приобрести автомобиль LADA с выгодой 10% от стоимости по государственным программам «Первый автомобиль» и «Семейный автомобиль».',
                'preview' => '/build/images/stocks/stock_02.jpg',
                'slug' => 'lada_vesta_vygoda_10_po_gosprogramme',
                'city_id' => 0,
            ],
            [
                'title' => 'LADA Granta 0% первоначальный взнос',
                'text' => '
                    <p>Наш дилерский центр предлагает услугу автокредитования. У Брайт Парка 18 банков-партнёров, которые предлагают разнообразные кредитные программы, в том числе и без первоначального взноса.</p>
                    <p>Также у вас есть возможность подать заявку на кредит онлайн прямо на нашем сайте.</p>
                    <p>Для подачи заявки на кредит вам понадобятся всего лишь два документа:</p>
                    <ul>
                        <li>паспорт РФ</li>
                        <li>второй документ на выбор (водительское удостоверение, СНИЛС, заграничный паспорт)</li>
                        <li>второй документ на выбор (водительское удостоверение, СНИЛС, заграничный паспорт)</li>
                    </ul>
                ',
                'text_short' => 'Наш дилерский центр предлагает услугу автокредитования. У Брайт Парка 18 банков-партнёров, которые предлагают разнообразные кредитные программы, в том числе и без первоначального взноса.',
                'preview' => '/build/images/stocks/stock_03.jpg',
                'slug' => 'lada_granta_0_pervonachalnyj_vznos',
                'city_id' => 0,
            ],
            [
                'title' => 'Обмен на LADA Vesta выше рыночной цены',
                'text' => '<p>Воспользуйтесь возможностью обменять свой автомобиль выше рыночной стоимости и с дополнительной выгодой - 40 000 рублей.</p>
                           <p>Обменять свой автомобиль в Брайт Парке - это удобно. Вам не нужно задумываться о реализации автомобиля, эту задачу на себя возьмут специалисты дилерского центра. Кроме того, участники программы обмена получают преимущество в виде выгоды на покупку нового автомобиля.</p>
                           <p>Также у вас есть уникальная возможность оценки вашего автомобиля онлайн по фото и видео вашего автомобиля.</p>
                           <p>Перечень документов покупателя:</p>
                           <ul>
                                <li>Паспорт гражданина РФ, владельца автомобиля.</li>
                                <li>Оригинал ПТС, подтверждающий срок владения автомобилем (не менее 6 месяцев).</li>
                                <li>Оригинал «Свидетельства о регистрации транспортного средства».</li>
                                <li>Копия паспорта транспортного средства БУ автомобиля с записью о переходе права собственности покупателю.</li>
                                <li>Документ выдан органами ГИБДД о регистрации БУ автомобиля за данным потребителем (КУТС либо справка, либо копия ПТС заверенная оригинальной печатью уполномоченного органа ГИБДД, либо копия ПТС заверенная нотариально).</li>
                            </ul>
                ',
                'text_short' => 'Воспользуйтесь возможностью обменять свой автомобиль выше рыночной стоимости и с дополнительной выгодой - 40 000 рублей.',
                'preview' => '/build/images/stocks/stock_04.jpg',
                'slug' => 'obmen_na_lada_vesta_vyshe_rynochnoj_ceny',
                'city_id' => 0,
            ],
            [
                'title' => 'Брайт Парк работает онлайн! Мы оказываем полный цикл услуг по приобретению автомобиля',
                'text' => '<p>Брайт Парк работает онлайн!</br>Мы оказываем полный цикл услуг по приобретению автомобиля</p>
                           <ul>
                                <li>Вы можете получить консультацию об автомобиле и совершению покупки онлайн. Мы обеспечим вас полной информацией с детальными фотографиями и видеообзором, выбранного вами автомобиля.</li>
                                <li>Мы оценим ваш автомобиль дистанционно, с помощью фотографий вашего автомобиля.</li>
                                <li>У вас есть возможность подать заявку на получение кредита онлайн. Выбрать подходящие условия  и подписать кредит у наших банков-партнёров.</li>
                                <li>Вы сможете забрать новый автомобиль в пункте самовывоза.</li>
                            </ul>
                            <p>Обращайтесь в Брайт парк! И уже в апреле вы сможете стать обладателем новой LADA!</p>
                         ',
                'text_short' => 'Брайт Парк работает онлайн!</br>Мы оказываем полный цикл услуг по приобретению автомобиля',
                'preview' => '/build/images/stocks/brajt_park_rabotaet_onlajn.jpg',
                'slug' => 'brajt_park_rabotaet_onlajn',
                'city_id' => 0,
            ],
        ];

        DB::table('stocks')->insert($stocks);
    }
}
